src/cf/Catalogs/ОфлайнОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОфлайнОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбработчикОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключенияОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ДатаЗагрузкиОтчетовКассЭвотор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДатаЗагрузкиОтчетовКассЭвотор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейЗакрытойКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейПопыткиЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КассаЭвотор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОфлайнОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКассаЭвотор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыОфлайнОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОфлайнОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЧекер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ОфлайнОборудование/Forms/ФормаНастройки1СЭвоторККМОфлайнПроизвольногоПериодаЗагрузки/Ext/Form/Module.bsl
#Область ОбработчикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаИнформацияНачальнаяЗагрузка.Видимость = Ложь;
	
	РезультатЗагрузки = Ложь;
	Параметры.Свойство("ИдентификаторУстройства", ИдентификаторУстройства);
	
	ТипОфлайнОборудования = ОбщегоНазначенияБПО.ЗначениеРеквизитаОбъекта(ИдентификаторУстройства, "ТипОфлайнОборудования");
	Если ТипОфлайнОборудования = Перечисления.ТипыОфлайнОборудования.ОФД Тогда
		Элементы.ДекорацияИнформация.РасширеннаяПодсказка.Заголовок = НСтр("ru='Укажите желаемый период загрузки данных'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ДатаЗагрузкиОтчетовКассЭвотор.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КассаЭвотор.Значение = Параметры.ИдентификаторУстройства;
	НаборЗаписей.Отбор.КассаЭвотор.Использование = Истина;
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
	
		Для Каждого Запись Из НаборЗаписей Цикл
			
			ДатаНачалаЗагрузки    = Запись.ДатаПоследнейЗакрытойКассовойСмены;
			ДатаОкончанияЗагрузки = ТекущаяДатаСеанса();
			
		КонецЦикла;
		
	Иначе
		
		УстановитьМаксимальнуюДатуЗагрузки();
		Элементы.ГруппаИнформацияНачальнаяЗагрузка.Видимость = Истина;
		
	КонецЕсли;
	
	МенеджерОфлайнОборудованияПереопределяемый.ФормаНастройкиПроизвольногоПериодаЭвоторПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикКомандФормы

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Результат = Неопределено;
	
	УстановитьПараметрыУстройства(Результат);
	
	Если Результат Тогда
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ЗагрузитьДанныеЗавершение", ЭтотОбъект);
		МенеджерОфлайнОборудованияКлиент.НачатьЗагрузкуДанныхИзККМ(ИдентификаторУстройства, УникальныйИдентификатор, ОповещениеПриЗавершении, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаЗагрузкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВыбранноеЗначение < ОбщегоНазначенияБПОКлиент.ДатаСеанса() - 6*30*86400 Тогда
		
		ТекстСообщения = НСтр("ru='Выбранный период загрузки превышает 6 месяцев'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		
	ИначеЕсли ВыбранноеЗначение > ДатаОкончанияЗагрузки Тогда
		
		ТекстСообщения = НСтр("ru='Начальная дата загрузки не может превышать конечную'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		
	Иначе
		
		ДатаНачалаЗагрузки = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияЗагрузкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение < ДатаНачалаЗагрузки Тогда
		СообщениеОбОшибке = НСтр("ru='Дата окончания загрузки не может быть меньше даты загрузки.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(СообщениеОбОшибке);
	Иначе
		ДатаОкончанияЗагрузки = КонецДня(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьДанныеЗавершение(Результат, Параметры) Экспорт
	
	УстановитьАвтоматическийПериодЗагрузки();
	РезультатЗагрузки = Результат.Результат;
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыУстройства(Результат)
	
	Результат = Неопределено;
	УстановитьПривилегированныйРежим(Истина);
	ДанныеУстройства = МенеджерОфлайнОборудованияВызовСервера.ДанныеУстройства(ИдентификаторУстройства);
	Если Не ДанныеУстройства.Параметры.Свойство("ДатаНачала") ИЛИ Не ДанныеУстройства.Параметры.Свойство("ДатаОкончания") Тогда
		СообщениеОбОшибке = НСтр("ru='Не записаны параметры устройства. Проведите настройку офлайн кассы.'");
		ОбщегоНазначенияБПО.СообщитьПользователю(СообщениеОбОшибке);
		Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрыУстройства = ДанныеУстройства.Параметры; // Структура
	ПараметрыУстройства.ДатаНачала           = ДатаНачалаЗагрузки;
	ПараметрыУстройства.ДатаОкончания        = ДатаОкончанияЗагрузки;
	ПараметрыУстройства.ЭтоПерваяЗагрузка    = Истина;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДатаЗагрузкиОтчетовКассЭвотор");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("КассаЭвотор", ИдентификаторУстройства);
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ДатаЗагрузкиОтчетовКассЭвотор.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КассаЭвотор.Значение = ИдентификаторУстройства;
		НаборЗаписей.Отбор.КассаЭвотор.Использование = Истина;
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись             = НаборЗаписей.Добавить();
			Запись.КассаЭвотор = ИдентификаторУстройства;
			Запись.ДатаПоследнейЗакрытойКассовойСмены = ДатаНачалаЗагрузки;
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ДанныеУстройства.Параметры.ПериодИзмененВручную = Истина;
		РезультатЗавершения = МенеджерОфлайнОборудованияВызовСервера.СохранитьПараметрыУстройства(ИдентификаторУстройства, ДанныеУстройства.Параметры);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗавершения Тогда
		Результат = РезультатЗавершения;
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		Результат = Ложь;
		СообщениеОбОшибке = НСтр("ru='Не удалось сохранить параметры устройства.'");
		ОбщегоНазначенияБПО.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьАвтоматическийПериодЗагрузки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеУстройства = МенеджерОфлайнОборудованияВызовСервера.ДанныеУстройства(ИдентификаторУстройства);
	ДанныеУстройства.Параметры.ПериодИзмененВручную = Ложь;
	
	РезультатЗавершения = МенеджерОфлайнОборудованияВызовСервера.СохранитьПараметрыУстройства(ИдентификаторУстройства, ДанныеУстройства.Параметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗавершения Тогда 
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		СообщениеОбОшибке = НСтр("ru='Не удалось сохранить параметры устройства.'");
		ОбщегоНазначенияБПО.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМаксимальнуюДатуЗагрузки()
	
	ДатаНачалаЗагрузки    = НачалоДня(ТекущаяДатаСеанса() - 6*30*86400 + 86400);
	ДатаОкончанияЗагрузки = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти
